In [1]:
import pandas as pd 
import numpy as np

In [2]:
df=pd.read_csv('purchase_data.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [4]:
df.shape

(780, 7)

1. Player Count
o Total Number of Players

In [5]:
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [6]:
total=df['SN'].nunique()
total

576

.2.Purchasing Analysis (Total)
o Number of Unique Items
o Average Purchase Price
o Total Number of Purchases
o Total Revenunue

In [7]:
df['Item ID'].nunique()

183

In [8]:
df['Price'].mean()

3.0509871794871795

In [9]:
df['Item Name'].nunique()

179

In [10]:
df['Price'].sum()

2379.77

3. Gender Demographics
o Percentage and Count of Male Players
o Percentage and Count of Female Players
o Percentage and Count of Other / Non-Disclosed

In [11]:
df_male=df[['SN','Gender']]
df_male

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [12]:
a=df.groupby(['SN','Gender'])
a

In [13]:
df_male=df[df['Gender']=='Male']
df_male

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
774,774,Jiskjask80,11,Male,101,Final Critic,4.19
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [14]:
df_male_unique=df_male['SN'].nunique()

In [15]:
df_male_unique

484

In [16]:
df_male_per=df_male_unique/total
df_male_per

0.8402777777777778

In [17]:
df_female=df[df['Gender']=='Female']
df_female_unique=df_female['SN'].nunique()
df_female_unique

81

In [18]:
df_female_per=df_female_unique/total
df_female_per

0.140625

In [19]:
df_other=df[df['Gender']=='Other / Non-Disclosed']
df_other_unique=df_other['SN'].nunique()
df_other_unique

11

In [20]:
df_other_per=df_other_unique/total
df_other_per

0.019097222222222224

"""4. Purchasing Analysis (Gender)
o The below each broken by gender
 Purchase Count
 Average Purchase Price
 Total Purchase Value
 Average Purchase Total per Person by Gender"""

In [21]:
print(df_male['Purchase ID'].count())
print(df_female['Purchase ID'].count())
print(df_other['Purchase ID'].count())

652
113
15

In [22]:
#Average purchase price
print(df_male['Price'].mean())
print(df_female['Price'].mean())
print(df_other['Price'].mean())

3.0178527607361967
3.203008849557522
3.3459999999999996

In [23]:
#Total purchase value
print(df_male['Price'].sum())
print(df_female['Price'].sum())
print(df_other['Price'].sum())

1967.64
361.94
50.19

In [24]:
a=df_male.groupby("SN")['Price'].mean()
a

SN
Adairialis76    2.280000
Aeda94          4.910000
Aela59          4.320000
Aelaria33       1.790000
Aelastirin39    3.645000
                  ...
Yasur85         1.100000
Yathecal72      3.460000
Yathedeu43      3.010000
Zhisrisu83      3.945000
Zontibe81       2.676667
Name: Price, Length: 484, dtype: float64

In [25]:
a=df_female.groupby("SN")['Price'].mean()
a

SN
Adastirin33      4.480000
Aerithllora36    4.320000
Aethedru70       3.540000
Aidain51         3.450000
Aiduesu86        4.480000
                   ...
Wailin72         2.730000
Yana46           3.550000
Yarithrin84      4.140000
Yathecal82       2.073333
Yoishirrala98    4.580000
Name: Price, Length: 81, dtype: float64

In [26]:
a=df_other.groupby("SN")['Price'].mean()
a

SN
Airi27          3.450
Chanosian48     3.760
Eodaisu60       3.940
Haerithp41      4.400
Idairin51       3.500
Jiskirran77     3.390
Lirtim36        1.330
Maluncil97      2.640
Rairith81       2.220
Siarithria38    3.455
Sundim98        4.750
Name: Price, dtype: float64

"""
5. Age Demographics
o The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
 Purchase Count
 Average Purchase Price
 Total Purchase Value
 Average Purchase Total per Person by Age Group """

In [27]:
df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [28]:
sorted_age=df.sort_values(by="Age")
sorted_age

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
33,33,Haillyrgue51,7,Male,44,Bonecarvin Battle Axe,2.38
778,778,Sisur91,7,Male,101,Final Critic,4.19
446,446,Chanossast57,7,Female,119,"Stormbringer, Dark Blade of Ending Misery",4.32
515,515,Haillyrgue51,7,Male,40,Second Chance,2.52
658,658,Quilassa66,7,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23
...,...,...,...,...,...,...,...
557,557,Frichaya88,42,Male,8,"Purgatory, Gem of Regret",3.93
674,674,Aeral68,43,Male,77,"Piety, Guardian of Riddles",4.00
248,248,Isursuir31,44,Male,137,"Aetherius, Boon of the Blessed",3.39
728,728,Chanosiaya39,44,Male,93,Apocalyptic Battlescythe,1.97
761,761,Assim27,45,Male,17,"Lazarus, Terror of the Earth",1.70

In [29]:
sorted_age['Age_Bin']=pd.cut(sorted_age['Age'],bins=[0, 10, 14,19,23,28,33,38,43,48])
sorted_age

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Bin
33,33,Haillyrgue51,7,Male,44,Bonecarvin Battle Axe,2.38,"(0, 10]"
778,778,Sisur91,7,Male,101,Final Critic,4.19,"(0, 10]"
446,446,Chanossast57,7,Female,119,"Stormbringer, Dark Blade of Ending Misery",4.32,"(0, 10]"
515,515,Haillyrgue51,7,Male,40,Second Chance,2.52,"(0, 10]"
658,658,Quilassa66,7,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,"(0, 10]"
...,...,...,...,...,...,...,...,...
557,557,Frichaya88,42,Male,8,"Purgatory, Gem of Regret",3.93,"(38, 43]"
674,674,Aeral68,43,Male,77,"Piety, Guardian of Riddles",4.00,"(38, 43]"
248,248,Isursuir31,44,Male,137,"Aetherius, Boon of the Blessed",3.39,"(43, 48]"
728,728,Chanosiaya39,44,Male,93,Apocalyptic Battlescythe,1.97,"(43, 48]"
761,761,Assim27,45,Male,17,"Lazarus, Terror of the Earth",1.70,"(43, 48]"

In [30]:
sorted_age.groupby('Age_Bin')['Purchase ID'].count()

Age_Bin
(0, 10]      32
(10, 14]     19
(14, 19]    136
(19, 23]    298
(23, 28]    155
(28, 33]     77
(33, 38]     44
(38, 43]     16
(43, 48]      3
Name: Purchase ID, dtype: int64

In [31]:
sorted_age.groupby('Age_Bin')['Price'].mean()

Age_Bin
(0, 10]     3.405000
(10, 14]    2.681579
(14, 19]    3.035956
(19, 23]    3.033020
(23, 28]    3.019290
(28, 33]    2.949351
(33, 38]    3.329091
(38, 43]    3.406250
(43, 48]    2.353333
Name: Price, dtype: float64

In [32]:
sorted_age.groupby('Age_Bin')['Price'].sum()

Age_Bin
(0, 10]     108.96
(10, 14]     50.95
(14, 19]    412.89
(19, 23]    903.84
(23, 28]    467.99
(28, 33]    227.10
(33, 38]    146.48
(38, 43]     54.50
(43, 48]      7.06
Name: Price, dtype: float64

In [33]:
forth=sorted_age.groupby(['Age_Bin','SN']).aggregate({'Price':'count'})
forth

                        Price
Age_Bin  SN
(0, 10]  Adairialis76       0
         Adastirin33        0
         Aeda94             0
         Aela59             0
         Aelaria33          0
...                       ...
(43, 48] Yathecal82         0
         Yathedeu43         0
         Yoishirrala98      0
         Zhisrisu83         0
         Zontibe81          0

[5184 rows x 1 columns]

Top Spenders
Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
1 SN
2 Purchase Count
3 Average Purchase Price
4 Total Purchas value

In [34]:
a=df.groupby('SN')['Price']
avg=pd.Series(a.mean())
puco=pd.Series(a.count())
totpu=pd.Series(a.sum())

In [35]:
data={
    "Average price":avg,"Purchase Count":puco,"Total Purchase":totpu
}
table=pd.concat(data,axis=1)
table

               Average price  Purchase Count  Total Purchase
SN
Adairialis76        2.280000               1            2.28
Adastirin33         4.480000               1            4.48
Aeda94              4.910000               1            4.91
Aela59              4.320000               1            4.32
Aelaria33           1.790000               1            1.79
...                      ...             ...             ...
Yathecal82          2.073333               3            6.22
Yathedeu43          3.010000               2            6.02
Yoishirrala98       4.580000               1            4.58
Zhisrisu83          3.945000               2            7.89
Zontibe81           2.676667               3            8.03

[576 rows x 3 columns]

In [36]:
table.sort_values(by="Total Purchase",ascending=False).head()

             Average price  Purchase Count  Total Purchase
SN
Lisosia93         3.792000               5           18.96
Idastidru52       3.862500               4           15.45
Chamjask73        4.610000               3           13.83
Iral74            3.405000               4           13.62
Iskadarya95       4.366667               3           13.10

Most Popular Items
o Identify the 5 most popular items by purchase count, then list (in a table):
Item ID
Item Name
Purchase Count
Item Price
Total Purchase Value

In [37]:
popular_item=df.groupby(['Item ID','Item Name','Price'])
popular_item

In [38]:
pucou=pd.Series(popular_item["Item ID"].count())
puva=pd.Series(popular_item["Price"].sum())

data={
    "Total Purchase":pucou,"Total Purchase Value":puva
}
table=pd.concat(data,axis=1)
table

,,,Total Purchase,Total Purchase Value
Item ID,Item Name,Price,,
0,Splinter,1.28,4,5.12
1,Crucifer,3.26,3,9.78
2,Verdict,2.48,6,14.88
3,Phantomlight,2.49,6,14.94
4,Bloodlord's Fetish,1.70,5,8.50
...,...,...,...,...
179,"Wolf, Promise of the Moonwalker",4.48,6,26.88
180,Stormcaller,3.36,1,3.36
181,Reaper's Toll,1.66,5,8.30
182,Toothpick,4.03,3,12.09
183,Dragon's Greatsword,1.09,3,3.27

In [39]:
table.sort_values(by="Total Purchase",ascending=False).head()

,,,Total Purchase,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
145,Fiery Glass Crusader,4.58,9,41.22
108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
82,Nirvana,4.90,9,44.10
19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16

8. Most Profitable Items
o the 5 most profitable items by total purchase value, then list (in a table):
 Item ID
 Item Name
 Purchase Count
 Item Price
 Total Purchase Value

In [40]:
table.sort_values(by="Total Purchase Value",ascending=False).head()

,,,Total Purchase,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
82,Nirvana,4.90,9,44.10
145,Fiery Glass Crusader,4.58,9,41.22
92,Final Critic,4.88,8,39.04
103,Singed Scalpel,4.35,8,34.80